Revit 2024 API
ExternalApplicationArrayIterator Class
An iterator to an array of IExternalApplication objects..
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class ExternalApplicationArrayIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class ExternalApplicationArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class ExternalApplicationArrayIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.UI.ExternalApplicationArrayIterator
See Also
ExternalApplicationArrayIterator Members
Autodesk.Revit.UI Namespace